class Urls:
    MAIN_PAGE = 'https://qa-scooter.praktikum-services.ru/' # Главная страница "Яндекс самокат"
    ORDER_PAGE = f"{MAIN_PAGE}order" # Страница заказа "Яндекс самокат"
    PAGE_DZEN = 'https://dzen.ru/?yredirect=true' # Страница "Дзен"

class User_1:
        first_name = "Мария"
        last_name = "Иванова"
        address = "Театральная, 12"
        metro_station = "Бульвар Рокоссовского"
        tel = "+79998887766"
        delivery_data = '10.04.2026'
        period = 'сутки'
        scooter_color = ''
        message = "Позвоните, пожалуйста, за час до доставки"

class User_2:
        first_name = "Алексей"
        last_name = "Петров"
        address = "Пятницкая, 10"
        metro_station = "Черкизовская"
        tel = "89993332211"
        delivery_data = '16.04.2026'
        period = 'двое суток'
        scooter_color = ''
        message = "Позвоните за 15 минут"

FAQ_ANSWER = [
    "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
    "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
    "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
    "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
    "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
    "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
    "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
    "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    ]